Ran Plan for dir: `ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_instance.public_ec2_instances[0] will be created
+ resource "aws_instance" "public_ec2_instances" {
      + ami                                  = "ami-08e4b984abde34a4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = "ec2_instance_profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "elasticsearch"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-031f70bafa6c2e4eb"
      + tags                                 = {
          + "Name" = "ansible-host"
        }
      + tags_all                             = {
          + "Name" = "ansible-host"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "d1fe113b5dd52262caa8fe1c1ffd162804d8db81"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-08c00be9ce7658c69",
        ]
    }

  # aws_instance.public_ec2_instances["ansible-host"] will be destroyed
  # (because resource does not use for_each)
- resource "aws_instance" "public_ec2_instances" {
      - ami                                  = "ami-08e4b984abde34a4f" -> null
      - arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0ff7e49983dc75912" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "ap-southeast-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2_instance_profile" -> null
      - id                                   = "i-0ff7e49983dc75912" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.small" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "elasticsearch" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-01fdeb1d0618472cd" -> null
      - private_dns                          = "ip-192-168-2-162.ap-southeast-1.compute.internal" -> null
      - private_ip                           = "192.168.2.162" -> null
      - public_ip                            = "18.140.243.242" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-031f70bafa6c2e4eb" -> null
      - tags                                 = {
          - "Name" = "ansible-host"
        } -> null
      - tags_all                             = {
          - "Name" = "ansible-host"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "e280e6f119a2de81c610384038466463ff40a660" -> null
      - vpc_security_group_ids               = [
          - "sg-08c00be9ce7658c69",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d4ec9218a8981b3b" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+ private_es_ec2_instance_ids = []
+ public_ec2_instance_ids     = [
      + (known after apply),
    ]
+ public_es_ec2_instance_ids  = []
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a3235ad69b8a:4141/lock?id=tampubolon%252Felasticsearch-lab%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2`
</details>
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`